app/controllers/comments_controller.rb

def create
    @product = Product.find(params[:product_id])
    @comment = @product.comments.new(comment_params)
    @comment.user = current_user
    respond_to do |format|
      if @comment.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("body", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Does this review stick?"], ["product_id", 2], ["user_id", 1], ["created_at", "2016-06-27 12:12:08.652454"], ["updated_at", "2016-06-27 12:12:08.652454"]]