app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%fdfdfdtype%')
SELECT "products".* FROM "products"
---
  def index
    if params[:q]
      search_term = params[:q]
      logger.debug "#{params[:q]}"
      byebug
    if Rails.env.development?
      @products = Product.where("name LIKE ?", "%#{search_term}%")
    end

    #Production
    if Rails.env.production?
      products = Product.where("name ilike ?", "%#{search_term}%")
    end
    else
      @products = Product.all

SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ?  ORDER BY created_at DESC LIMIT 3 OFFSET 0  [["product_id", 2]]
---
  def show
    @comments = @product.comments.order("created_at DESC").paginate(:page => params[:page], :per_page => 3)

INSERT INTO "products" ("name", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test new product"], ["description", "test"], ["image_url", "test.jpg"], ["price", 100.0], ["created_at", "2016-08-03 18:18:11.336389"], ["updated_at", "2016-08-03 18:18:11.336389"]]
---
  def create
    @product = Product.new(product_params)
    byebug

    respond_to do |format|
      if @product.save

UPDATE "products" SET "image_url" = ?, "colour" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "bike-mountain_1.jpg"], ["colour", ""], ["updated_at", "2016-05-09 20:21:38.968659"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)