app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Laura"], ["last_name", "Theis"], ["updated_at", "2016-06-22 13:11:21.421946"], ["id", 1]]